# SQL with ChatGPT in Python

`Write an SQLite query in Python to create a database. Write an SQLite query in Python to create a database.`

In [1]:
import sqlite3

# Connect to the database
conn = sqlite3.connect("mydatabase.db")

# Create a cursor
cursor = conn.cursor()

# Create the table
cursor.execute("CREATE TABLE demo (id INTEGER PRIMARY KEY, name TEXT, age INTEGER, job TEXT)")

# Commit the transaction
conn.commit()

# Close the connection
conn.close()

`Add 100 random values inside this table.`

In [2]:
import sqlite3
import random

# Connect to the database
conn = sqlite3.connect("mydatabase.db")

# Create a cursor
cursor = conn.cursor()

# Generate 100 random values
for i in range(100):
    name = "Name" + str(i)
    age = random.randint(18, 60)
    job = "Job" + str(i)

    # Insert the values into the table
    cursor.execute("INSERT INTO demo (name, age, job) VALUES (?, ?, ?)", (name, age, job))

# Commit the transaction
conn.commit()

# Close the connection
conn.close()

` Write a SQL query in Python to show the first 5 values in this table.`

In [3]:
import sqlite3

# Connect to the database
conn = sqlite3.connect("mydatabase.db")

# Create a cursor
cursor = conn.cursor()

# Execute the SELECT query
cursor.execute("SELECT * FROM demo LIMIT 5")

# Fetch the results
results = cursor.fetchall()

# Print the results
for row in results:
    print(row)

# Close the connection
conn.close()

(1, 'Name0', 60, 'Job0')
(2, 'Name1', 56, 'Job1')
(3, 'Name2', 57, 'Job2')
(4, 'Name3', 21, 'Job3')
(5, 'Name4', 32, 'Job4')

`Write a SQL query in Python to see the average of the age column in this table.`

In [4]:
import sqlite3

# Connect to the database
conn = sqlite3.connect("mydatabase.db")

# Create a cursor
cursor = conn.cursor()

# Execute the SELECT query
cursor.execute("SELECT AVG(age) FROM demo")

# Fetch the result
result = cursor.fetchone()

# Print the result
print(result[0])

# Close the connection
conn.close()

37.65

## Working with a database in Python using Chat GPT

`Write a SQL query in Python to see the names of the tables in the database named my_demo.db.`

In [5]:
import sqlite3

# Connect to the database
conn = sqlite3.connect("my_demo.db")

# Create a cursor
cursor = conn.cursor()

# Execute the SELECT query
cursor.execute("SELECT name FROM sqlite_master WHERE type='table'")

# Fetch the results
results = cursor.fetchall()

# Print the results
for row in results:
    print(row[0])

# Close the connection
conn.close()

emp
dept

`Write a SQL query in Python to see the values of the emp table in the database named my_demo.db.`

In [6]:
import sqlite3

# Connect to the database
conn = sqlite3.connect("my_demo.db")

# Create a cursor
cursor = conn.cursor()

# Execute the SELECT query
cursor.execute("SELECT * FROM emp")

# Fetch the results
results = cursor.fetchall()

# Print the results
for row in results:
    print(row)

# Close the connection
conn.close()

(7369, 'SMITH', 'CLERK', 7902, '1980-12-17', 800, None, 20)
(7499, 'ALLEN', 'SALESMAN', 7698, '1981-02-20', 1600, 300, 30)
(7521, 'WARD', 'SALESMAN', 7698, '1981-02-22', 1250, 500, 30)
(7566, 'JONES', 'MANAGER', 7839, '1981-04-02', 2975, None, 20)
(7654, 'MARTIN', 'SALESMAN', 7698, '1981-09-28', 1250, 1400, 30)
(7698, 'BLAKE', 'MANAGER', 7839, '1981-05-01', 2850, None, 30)
(7782, 'CLARK', 'MANAGER', 7839, '1981-06-09', 2450, None, 10)
(7788, 'SCOTT', 'ANALYST', 7566, '1982-12-09', 3000, None, 20)
(7839, 'KING', 'PRESIDENT', None, '1981-11-17', 5000, None, 10)
(7844, 'TURNER', 'SALESMAN', 7698, '1981-09-08', 1500, 0, 30)
(7876, 'ADAMS', 'CLERK', 7788, '1983-01-12', 1100, None, 20)
(7900, 'JAMES', 'CLERK', 7698, '1981-12-03', 950, None, 30)
(7902, 'FORD', 'ANALYST', 7566, '1981-12-03', 3000, None, 20)
(7934, 'MILLER', 'CLERK', 7782, '1982-01-23', 1300, None, 10)

`Write a SQL query in Python to see the values less than 5000 in the sal column in the emp table.`

In [7]:
import sqlite3

# Connect to the database
conn = sqlite3.connect("my_demo.db")

# Create a cursor
cursor = conn.cursor()

# Execute the SELECT query
cursor.execute("SELECT * FROM emp WHERE sal < 5000")

# Fetch the results
results = cursor.fetchall()

# Print the results
for row in results:
    print(row)

# Close the connection
conn.close()

(7369, 'SMITH', 'CLERK', 7902, '1980-12-17', 800, None, 20)
(7499, 'ALLEN', 'SALESMAN', 7698, '1981-02-20', 1600, 300, 30)
(7521, 'WARD', 'SALESMAN', 7698, '1981-02-22', 1250, 500, 30)
(7566, 'JONES', 'MANAGER', 7839, '1981-04-02', 2975, None, 20)
(7654, 'MARTIN', 'SALESMAN', 7698, '1981-09-28', 1250, 1400, 30)
(7698, 'BLAKE', 'MANAGER', 7839, '1981-05-01', 2850, None, 30)
(7782, 'CLARK', 'MANAGER', 7839, '1981-06-09', 2450, None, 10)
(7788, 'SCOTT', 'ANALYST', 7566, '1982-12-09', 3000, None, 20)
(7844, 'TURNER', 'SALESMAN', 7698, '1981-09-08', 1500, 0, 30)
(7876, 'ADAMS', 'CLERK', 7788, '1983-01-12', 1100, None, 20)
(7900, 'JAMES', 'CLERK', 7698, '1981-12-03', 950, None, 30)
(7902, 'FORD', 'ANALYST', 7566, '1981-12-03', 3000, None, 20)
(7934, 'MILLER', 'CLERK', 7782, '1982-01-23', 1300, None, 10)

- Thanks for reading ðŸ˜€ 
- Let's connect [YouTube](http://youtube.com/tirendazacademy) | [Medium](http://tirendazacademy.medium.com) | [Twitter](http://twitter.com/tirendazacademy) | [Instagram](https://www.instagram.com/tirendazacademy) | [Linkedin](https://www.linkedin.com/in/tirendaz-academy) ðŸ˜Ž